cask_args appdir: "/Applications"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "heroku/brew"

# Essentials
# ===

brew "mas"

brew "git-extras"
brew "htop"
brew "thefuck"
brew "wget"
brew "tig"
brew "hstr"
brew "openssl"
brew "openfortivpn"
cask "macmediakeyforwarder"
cask "scroll-reverser"
cask "iterm2"

brew "nvm"
brew "redis"
brew "python3"
brew "python@3.8"

# Apps
# ===

cask "docker"
cask "ngrok"
cask "keybase"
cask "1password"
cask "slack"
cask "transmission"
cask "google-chrome"
cask "firefox"
cask "tor-browser"
cask "visual-studio-code"
mas "iMovie", id: 408981434
mas "Xcode", id: 497799835
cask "appcleaner"
cask "vlc"
mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
cask "insomnia"
cask "spotify"
brew "handbrake"
mas "Affinity Photo", id: 824183456

# Fonts 
# ===
cask "font-open-sans"
cask "font-roboto"

cask "font-hack"
cask "font-roboto-mono"
cask "font-source-code-pro"
