cask_args appdir: "/Applications"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "heroku/brew"
tap "teamookla/speedtest"

# shell
# ===
brew "spaceship"

# Essentials
# ===
brew "mas"

brew "git"
brew "git-extras"
brew "htop"
brew "thefuck"
brew "wget"
brew "tig"
brew "hstr"
brew "openssl"
brew "openfortivpn"
cask "macmediakeyforwarder"
cask "scroll-reverser"
cask "iterm2"

brew "svn"
brew "nvm"
brew "redis"
brew "python3"  # 3.11 or latest
brew "python@3.10"
brew "poetry"
brew "pylint"
brew "pre-commit"
brew "black"

# plantuml
# ===

brew "openjdk"
brew "graphviz"

# Apps
# ===

# under license usually 
# cask "docker"
# alternative
#brew "podman"

cask "rancher"
brew "kubectl"
brew "helm"
brew "buildah"

brew "1password-cli"
cask "ngrok"
cask "1password"
mas "1password-for-safari", id: 1569813296
cask "slack"
cask "signal"
cask "transmission"
cask "google-chrome"
cask "firefox"
cask "tor-browser"
cask "visual-studio-code"
mas "iMovie", id: 408981434
mas "Xcode", id: 497799835
cask "appcleaner"
cask "vlc"
mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
cask "insomnia"
cask "spotify"
brew "handbrake"
mas "Affinity Photo", id: 824183456

# Fonts 
# ===
brew "svn" # requirement for fonts 
cask "font-open-sans"
cask "font-roboto"

cask "font-hack"
cask "font-roboto-mono"
cask "font-source-code-pro"

# Tools 
# ===
brew "exiftool"
brew "speedtest"
cask "android-file-transfer"
