cask_args appdir: "/Applications"
tap "heroku/brew"
tap "teamookla/speedtest"

# shell
# ===
brew "spaceship"

# Essentials
# ===
brew "mas"

brew "git"
brew "git-extras"
brew "htop"
brew "thefuck"
brew "wget"
brew "tig"
brew "glab"
brew "hstr"
brew "openssl"
cask "scroll-reverser"
cask "iterm2"

brew "svn"
# node 
brew "node"
brew "nvm"

brew "python3"  # latest
brew "pre-commit"
brew "ruff"
brew "uv"


brew "openjdk"

# Apps
# ===

brew "colima"

brew "kubectl"
brew "k9s"
brew "helm"
# brew "buildah"
cask "stats"

# cask "ngrok"
cask "1password"
cask "1password-cli"
mas "1password-for-safari", id: 1569813296
# cask "slack"
# cask "signal"
cask "google-chrome"
cask "visual-studio-code"
# mas "iMovie", id: 408981434
# mas "Xcode", id: 497799835
# cask "appcleaner"
# cask "vlc"
mas "Magnet", id: 441258766
# cask "insomnia"
# cask "spotify"

# Fonts 
# ===
brew "svn" # requirement for fonts 
cask "font-open-sans"
cask "font-roboto"

cask "font-hack"
cask "font-roboto-mono"
cask "font-source-code-pro"

# Tools 
# ===
brew "exiftool"
# brew "speedtest"
# cask "android-file-transfer"
